Documents/ВыполнениеРабот.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВыполнениеРабот</Name>
			<BasedOn>
				<xr:Item>Document.ЗаявкаКлиента</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ВыполненныеРаботы</xr:Item>
				<xr:Item>InformationRegister.СостоянияЗаявок</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиМатериалов</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заказчик</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Клиенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Склады</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заявка</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЗаявкаКлиента</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СтатусЗаявки</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СтатусыЗаявок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Материалы</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ВыполнениеРабот/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаКлиенте
Процедура МатериалыКоличествоПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ОбщиеМодулиНаКлиенте.ИзменениеСуммы(ТекущаяСтрока);
КонецПроцедуры

&НаКлиенте
Процедура МатериалыЦенаПриИзменении(Элемент)
	ТекущаяСтрока = Элементы.Материалы.ТекущиеДанные;
	ОбщиеМодулиНаКлиенте.ИзменениеСуммы(ТекущаяСтрока);
КонецПроцедуры


&НаСервереБезКонтекста
Функция ПолучитьЦенуНоменклатуры(ВыбраннаяНоменклатура)
	Возврат ВыбраннаяНоменклатура.ЦенаПродажи;
КонецФункции

&НаКлиенте
Процедура МатериалыНоменклатураПриИзменении(Элемент)

	СтрокаТЧ = Элементы.Материалы.ТекущиеДанные;
	Если СтрокаТЧ <> Неопределено Тогда
		Если ЗначениеЗаполнено(СтрокаТЧ.Номенклатура) Тогда
			СтрокаТЧ.Цена = ПолучитьЦенуНоменклатуры(СтрокаТЧ.Номенклатура);
			Если ЗначениеЗаполнено(СтрокаТЧ.Количество) Тогда
				СтрокаТЧ.Сумма = СтрокаТЧ.Количество * СтрокаТЧ.Цена;
			Иначе
				СтрокаТЧ.Количество = 1;
				СтрокаТЧ.Сумма = СтрокаТЧ.Цена;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;

КонецПроцедуры
